cdhooper/amigapci_stm32/pcmds.c
/*
 * This is free and unencumbered software released into the public domain.
 * See the LICENSE file for additional details.
 *
 * Designed by Chris Hooper in 2020.
 *
 * ---------------------------------------------------------------------
 *
 * Command implementations.
 */

#include "printf.h"
#include <stdlib.h>
#include <ctype.h>
#include <string.h>
#include "board.h"
#include "main.h"
#include "cmdline.h"
#include <stdbool.h>
#include "timer.h"
#include "uart.h"
#include "cmds.h"
#include "gpio.h"
#include "amigartc.h"
#include "pcmds.h"
#include "adc.h"
#include "utils.h"
#include "usb.h"
#include "irq.h"
#include "config.h"
#include "fan.h"
#include "hiden.h"
#include "kbrst.h"
#include "keyboard.h"
#include "led.h"
#include "power.h"
#include "rtc.h"
#include "sensor.h"

#include <libopencm3/cm3/scb.h>
#include <libopencm3/stm32/gpio.h>
#include <libopencm3/stm32/memorymap.h>
#define GPIOA_BASE GPIO_PORT_A_BASE
#define GPIOB_BASE GPIO_PORT_B_BASE
#define GPIOC_BASE GPIO_PORT_C_BASE
#define GPIOD_BASE GPIO_PORT_D_BASE
#define GPIOE_BASE GPIO_PORT_E_BASE

#ifndef SRAM_BASE
#define SRAM_BASE 0x20000000U
#endif

#define ROM_BANKS 8

#if defined(STM32F4)
#define FLASH_BASE FLASH_MEM_INTERFACE_BASE
#endif

const char cmd_amiga_help[] =
"amiga keyboard - act as Amiga keyboard\n"
"amiga status   - show Amiga status";

const char cmd_cpu_help[] =
"cpu hardfault - cause CPU hard fault (bad address)\n"
"cpu regs      - show CPU registers";

const char cmd_fan_help[] =
"fan auto        - automatically adjust fan speed\n"
"fan on          - turn fan on\n"
"fan off         - turn fan off\n"
"fan speed <num> - set fan speed to specified %%\n";

const char cmd_gpio_help[] =
"gpio [name=value/mode/?] - display or set GPIOs";

const char cmd_reset_help[] =
"reset              - reset CPU\n"
"reset amiga [hold] - reset Amiga using KBRST (hold leaves it in reset)\n"
"reset amiga long   - reset Amiga with a long reset (change ROM image)\n"
"reset dfu[rom]     - reset into DFU programming mode\n"
"reset reason       - show STM32 previous reset reason\n"
"reset usb          - reset and restart USB interface";

const char cmd_set_help[] =
"set cpu_temp_bias <num>  - Bias (+/-) for CPU temperature\n"
"set debug <flags> [save] - set debug flags\n"
"set defaults             - Force all settings to default values\n"
"set fan_rpm_max <num>    - Fan maximum speed in RPM\n"
"set fan_speed <num>|auto - Fan speed\n"
"set fan_speed_min <num>  - Fan speed minimum percent\n"
"set fan_temp_max <num>   - CPU temp for max fan speed\n"
"set fan_temp_min <num>   - CPU temp for min fan speed\n"
"set name <name>          - set board name\n"
"set pson <num>           - set power on mode (1=On at AC restore)\n"
"set time <y/m/d>|<h:m:s> - set RTC time and/or date";

const char cmd_power_help[] =
"power cycle - cycle the power supply off/on\n"
"power on    - turn on power supply\n"
"power off   - turn off power supply\n"
"power show  - display current power status";

const char cmd_snoop_help[] =
"snoop        - capture and report ROM transactions\n"
"snoop addr   - hardware capture A0-A19\n"
"snoop lo     - hardware capture A0-A15 D0-D15\n"
"snoop hi     - hardware capture A0-A15 D16-D31";

const char cmd_usb_help[] =
   "usb debug <mask> - set debug mask\n"
   "usb disable      - reset and disable USB\n"
   "usb kbd [on|off] - take input from USB keyboard\n"
   "usb ls           - list USB devices present\n"
   "usb off          - power off USB ports\n"
   "usb on           - power on USB ports\n"
   "usb regs         - display USB device registers\n"
   "usb reset        - reset and restart USB device\n"
   "usb stats        - USB statistics";

typedef struct {
    const char *const name;
    uintptr_t         addr;
} memmap_t;

static const memmap_t memmap[] = {
    { "ADC1",   ADC1_BASE },
    { "ADC2",   ADC2_BASE },
    { "ADC3",   ADC3_BASE },
    { "AHB1",   PERIPH_BASE_AHB1 },
    { "AHB2",   PERIPH_BASE_AHB2 },
    { "APB1",   PERIPH_BASE_APB1 },
    { "APB2",   PERIPH_BASE_APB2 },
#ifdef STM32F1
    { "AFIO",   AFIO_BASE },
    { "BKP",    BACKUP_REGS_BASE },
#endif
#if defined(STM32F103xE)
    { "BKP",    RTC_BKP_BASE },
#endif
    { "DAC",    DAC_BASE },
    { "DMA1",   DMA1_BASE },
    { "DMA2",   DMA2_BASE },
    { "EXTI",   EXTI_BASE },
    { "FLASH",  FLASH_BASE },
    { "FPEC",   FLASH_MEM_INTERFACE_BASE },
    { "GPIOA",  GPIOA_BASE },
    { "GPIOB",  GPIOB_BASE },
    { "GPIOC",  GPIOC_BASE },
    { "GPIOD",  GPIOD_BASE },
    { "GPIOE",  GPIOE_BASE },
    { "IWDG",   IWDG_BASE },
    { "PWR",    POWER_CONTROL_BASE },
    { "RCC",    RCC_BASE },
    { "RTC",    RTC_BASE },
    { "SCB",    SCB_BASE },
    { "SRAM",   SRAM_BASE },
    { "SYSCFG", SYSCFG_BASE },
    { "TIM1",   TIM1_BASE },
    { "TIM2",   TIM2_BASE },
    { "TIM3",   TIM3_BASE },
    { "TIM4",   TIM4_BASE },
    { "TIM5",   TIM5_BASE },
    { "TIM8",   TIM8_BASE },
    { "USART1", USART1_BASE },
    { "USART3", USART3_BASE },
    { "USB0",   USB0_BASE },
    { "USB1",   USB1_BASE },
    { "WWDG",   WWDG_BASE },
};

static uint
time_check(const char *text, uint diff, uint min, uint max)
{
    int errs = 0;
    if ((min <= diff) && (max >= diff)) {
        printf("PASS: ");
    } else {
        printf("FAIL: ");
        errs++;
    }
    printf("%-24s %u usec\n", text, diff);
    return (errs);
}

static rc_t
timer_test(void)
{
    uint64_t start;
    uint64_t diff;
    uint     errs = 0;

    start = timer_tick_get();
    timer_delay_ticks(0);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_ticks(0)", (uint)diff, 0, 5);

    start = timer_tick_get();
    timer_delay_ticks(100);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_ticks(100)", (uint)diff, 2, 5);

    start = timer_tick_get();
    timer_delay_usec(1);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_usec(1)", (uint)diff, 1, 5);

    start = timer_tick_get();
    timer_delay_usec(10);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_usec(10)", (uint)diff, 10, 15);

    start = timer_tick_get();
    timer_delay_usec(1000);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_usec(1000)", (uint)diff, 1000, 1005);

    start = timer_tick_get();
    timer_delay_msec(1);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_msec(1)", (uint)diff, 1000, 1005);

    start = timer_tick_get();
    timer_delay_msec(10);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_msec(10)", (uint)diff, 10000, 10007);

    start = timer_tick_get();
    timer_delay_msec(1000);
    diff = timer_tick_to_usec(timer_tick_get() - start);
    errs += time_check("timer_delay_msec(1000)", (uint)diff, 1000000, 1000007);

    // XXX: Replace one second above with RTC tick?

    if (errs > 0)
        return (RC_FAILURE);
    return (RC_SUCCESS);
}

static rc_t
timer_watch(void)
{
    bool_t   fail = FALSE;
    uint64_t last = timer_tick_get();
    uint64_t now;

    while (1) {
        now = timer_tick_get();
        if (last >= now) {
            printf("\nLast=%llx now=%llx Current=%012llx",
                   (long long) last, (long long) now, timer_tick_get());
        } else {
            if ((last >> 32) != (now >> 32))
                putchar('.');
            last = now;
        }
        if (input_break_pending()) {
            printf("^C\n");
            break;
        }
    }
    return ((fail == TRUE) ? RC_FAILURE : RC_SUCCESS);
}

static rc_t
cmd_time_set(int argc, char * const *argv)
{
    int arg;
    for (arg = 1; arg < argc; arg++) {
        uint year, mon, day;
        uint hour, min, sec;
        uint ch;

        if (sscanf(argv[arg], "%u%1[-/]%u%1[-/]%u",
                   &year, &ch, &mon, &ch, &day) == 5) {
            rtc_allow_writes(TRUE);
            rtc_set_date(year, mon, day, 0);
            rtc_allow_writes(FALSE);
        } else if (sscanf(argv[arg], "%u:%u:%u", &hour, &min, &sec) == 3) {
            rtc_allow_writes(TRUE);
            rtc_set_time(hour, min, sec, 0, 0);
            rtc_allow_writes(FALSE);
        } else {
            printf("Unknown time set argument %s\n", argv[arg]);
            return (RC_BAD_PARAM);
        }
    }
    rtc_print(1);

    return (RC_SUCCESS);
}

